# 1) შექმენით 10 ელემენტიანი list'ი და კომენტარის სახით დანომრეთ (მიუწერეთ ინდექსები). შემდეგ კი უბრალოდ გამოიტანეთ ეკრანზე
#   list=[1, 2, 3, 4, 5 , 6, 7, 8, 9, 10]
#  print(list)
# 2) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 დადებითი ინდექსებით
# list=[1, 2, 3, 4, 5 , 6, 7, 8, 9, 10]
# print(list[0:3])
# print(list[7:])
# print(list[5:9])
# 3) პირველ დავალებაში შექმნილი List'იდან გამოიტანეთ პირველი სამი, ბოლო სამი და შუა 4 უარყოფითი ინდექსებით
# list=[1, 2, 3, 4, 5 , 6, 7, 8, 9, 10]
# print(list[0:3])
# print(list[7:])
# print(list[-5:-1])
# 4) შექმენით ახალი list'ი, გადაატარეთ for loop'ი და ცალ-ცალკე გამოიტანეთ ყველა ლისტის ელემენტი
# list=[2,45,68,90,21,89]
# for i in list:
#     print(i)
# 5) შექმენით string ტიპის ცვლადი, გადაატარეთ for loop'ი და ცალ-ცალკე გამოიტანეთ ყველა სიმბოლო
# str1="Hello world"
# word1= str1[:5]
# word2= str1[6:]
# print(word1)
# print(word2)
# 6) შექმენით 5 სიტყვიანი სტრინგი, შექმენით კიდევ 5 ახალი ცვლადი და ინდექსინგის მეშვეობით თითოეულს მიანიჭეთ პირველი სტრინგიდან სიტყვები
# a="programming is the best proffesion"
# first=a[:11]
# second=a[12:13]
# third=a[14:16]
# fourth=a[17:20]
# fifth=a[21:30]
# print(first)
# print(second)
# print(third)
# print(fourth)
# print(fifth)